---
kind: property
id: P:Autodesk.Revit.DB.BarTypeDiameterOptions.BarNominalDiameter
source: html/15663f45-109d-6bf0-980f-4caf23711ed5.htm
---
# Autodesk.Revit.DB.BarTypeDiameterOptions.BarNominalDiameter Property

Represents the bar nominal diameter of the RebarBarType.

## Syntax (C#)
```csharp
public double BarNominalDiameter { get; set; }
```